MTWT <- "https://weilunlo.github.io/KTVcaculator/testKTVcalculator/boxMTWT.csv"
boxMTWT <- read.csv(MTWT,header = T, sep = ",")
Fri <- "https://weilunlo.github.io/KTVcaculator/testKTVcalculator/boxFri.csv"
boxFri <- read.csv(Fri,header = T, sep = ",")
Sat <- "https://weilunlo.github.io/KTVcaculator/testKTVcalculator/boxSat.csv"
boxSat <- read.csv(Sat,header = T, sep = ",")
Sun <- "https://weilunlo.github.io/KTVcaculator/testKTVcalculator/boxSun.csv"
boxSun <- read.csv(Sun,header = T, sep = ",")

#names(boxMTWT) <- c("分店", "迷你(2~3人)","小(4~6人)", "中(7~9人)","大(10~12人)", "特大(13~15)",
#                   "小VIP(15~18人)","中VIP(15~18人)","VIP(18人up)","0點","1點","2點","3點","4點",
#                    "5點","6點","7點","8點","9點","10點","11點","12點","13點","14點","15點","16點",
#                    "17點","18點","19點","20點","21點","22點","23點","店","地址","電話","威力卡")

#names(boxFri) <- c("分店", "迷你(2~3人)","小(4~6人)", "中(7~9人)","大(10~12人)", "特大(13~15)",
#                    "小VIP(15~18人)","中VIP(15~18人)","VIP(18人up)","0點","1點","2點","3點","4點",
#                    "5點","6點","7點","8點","9點","10點","11點","12點","13點","14點","15點","16點",
#                    "17點","18點","19點","20點","21點","22點","23點","店","地址","電話","威力卡")

#names(boxSat) <- c("分店", "迷你(2~3人)","小(4~6人)", "中(7~9人)","大(10~12人)", "特大(13~15)",
#                    "小VIP(15~18人)","中VIP(15~18人)","VIP(18人up)","0點","1點","2點","3點","4點",
#                    "5點","6點","7點","8點","9點","10點","11點","12點","13點","14點","15點","16點",
#                    "17點","18點","19點","20點","21點","22點","23點","店","地址","電話","威力卡")

#names(boxSun) <- c("分店", "迷你(2~3人)","小(4~6人)", "中(7~9人)","大(10~12人)", "特大(13~15)",
#                    "小VIP(15~18人)","中VIP(15~18人)","VIP(18人up)","0點","1點","2點","3點","4點",
#                    "5點","6點","7點","8點","9點","10點","11點","12點","13點","14點","15點","16點",
#                    "17點","18點","19點","20點","21點","22點","23點","店","地址","電話","威力卡")